** Default Implementations

   Sometimes it's useful to have default behavior for some or all of the methods in a trait instead of requiring implementations for all methods on every type.
   Then, as we implement the trait on a particular type, we can override each method's default behavior.

   We can specify a default string for the summarize method of the Summary trait instead of defining the method signature:

#+name:
#+BEGIN_SRC rust
pub trait Summary {
    fn summarize(&self) -> String {
	String::from("(Read more...)")
    }
}
#+END_SRC

To use a default implementation to summarize, we specify an empty impl block

#+name:
#+BEGIN_SRC rust
pub trait Summary {
    fn summarize(&self) -> String {
        String::from("(Read more...)")
    }
}

impl Summary for NewsArticle {}

pub struct NewsArticle {
    pub headline: String,
    pub location: String,
    pub author: String,
    pub content: String,
}

fn main() {
    let article = NewsArticle {
        headline: "Penguins".to_string(),
        location: "Antarctica".to_string(),
        author: "GTP4".to_string(),
        content: "The Pittsburgh Penguins have somehow ended up in Antarctica".to_string(),
    };

    println!("News Article:\t{}", article.summarize());
}
#+END_SRC

Creating a default implementation for summarize doesn't allow us to change anything about the implementation of summary on another struct. The syntax for implementing a default implementation is the same as the syntax for implementing a trait method that doesn't have a default implementation.

Default implementations can call other methods in the same trait, even if those other methods don't have a default implementation. In this way, a trait can provude a lot of useful functionality and only require implementors to specify a small part of it.

#+name:
#+BEGIN_SRC rust
#![allow(unused)]

// we only need to define summarize_author when we implement the trait on a type
pub trait Summary {
    fn summarize_author(&self) -> String;

    fn summarize(&self) -> String {
        format!("(Read more from {}...)", self.summarize_author())
    }
}

pub struct Tweet {
    pub username: String,
    pub content: String,
    pub reply: bool,
    pub retweet: bool,
}

impl Summary for Tweet {
    fn summarize_author(&self) -> String {
        format!("@{}", self.username)
    }
}

fn main() {
    let tweet = Tweet {
        username: "horse_ebooks".to_string(),
        content: "Of course, as you probably know, people".to_string(),
        reply: false,
        retweet: false,
    };

    println!("1 new tweet: {}", tweet.summarize());
}
#+END_SRC

#+RESULTS: 
: 1 new tweet: (Read more from @horse_ebooks...)

Note that it isn't possible to call the default implementation from an overriding implementation of that same method.

